# Packages
brew "arp-scan"
brew "bat"
brew "btop"
brew "claude-code"
brew "coreutils"
brew "curl"
brew "docker"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "imagemagick"
brew "ipcalc"
brew "jemalloc"
brew "jq"
brew "libpq"
brew "libssh2"
brew "libyaml"
brew "mas"
brew "mise"
brew "neovim"
brew "ollama"
brew "overmind"
brew "pnpm"
brew "postgresql@17"
brew "redis"
brew "ripgrep"
brew "starship"
brew "telnet"
brew "uv"
brew "vips"
brew "webp"
brew "wget"
brew "yadm"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"

# Cask applications
cask "asana"
cask "blockblock"
cask "brave-browser"
cask "canva"
cask "chatgpt"
cask "claude"
cask "cloudflare-warp"
cask "codeedit"
cask "copilot-money"
cask "coteditor"
cask "discord"
cask "ghostty"
cask "hiddenbar"
cask "itsycal"
cask "knockknock"
cask "ledger-live"
cask "localsend"
cask "logi-options+"
cask "lulu"
cask "microsoft-edge"
cask "monitorcontrol"
cask "mos"
cask "neo-network-utility"
cask "netiquette"
cask "notion"
cask "orbstack"
cask "pearcleaner"
cask "postman"
cask "ransomwhere"
cask "rectangle"
cask "shottr"
cask "silentknight"
cask "slack"
cask "sloth"
cask "zed"
cask "zoom"

# Fonts
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-caskaydia-mono-nerd-font"
cask "font-commit-mono"
cask "font-dm-sans"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-geist"
cask "font-geist-mono"
cask "font-google-sans-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-work-sans"

# Mac App Store applications
mas "Adblock Plus", id: 1432731683
mas "Bear", id: 1091189122
mas "Bitwarden", id: 1352778147
mas "Flighty", id: 1358823008
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
